##Banco de Dados

In [ ]:
import sqlite3

conexao = sqlite3.connect('exercicio')
cursor = conexao.cursor()

**1. Crie uma tabela chamada "alunos" com os seguintes campos: id(inteiro), nome (texto), idade (inteiro) e curso (texto).**

In [2]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')

**2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.**

In [ ]:
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(1,"Thamires","20","Economia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(2,"João","22","Medicina")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(3,"Maria","25","jornalismo")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(4,"Nathalia","21","Enfermagem")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(5,"Gabriel","23","TI")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(6,"Ana","22","Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(7,"Julio","21","Engenharia")')

**3. Consultas Básicas: Escreva consultas SQL para realizar as seguintes tarefas:**

* a) Selecionar todos os registros da tabela "alunos".

In [ ]:
alunos = cursor.execute('SELECT * FROM alunos')
for alunos in alunos:
    print(alunos)

* b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
alunos = cursor.execute('SELECT nome FROM alunos where idade>20')
for alunos in alunos:
    print(alunos)

* c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [3]:
alunos = cursor.execute('SELECT * FROM alunos WHERE curso="Engenharia" ORDER BY nome')
for alunos in alunos:
    print(alunos)

* d) Contar o número total de alunos na tabela.

In [ ]:
alunos = cursor.execute('SELECT COUNT (*) FROM alunos')
for alunos in alunos:
    print(alunos)

**4. Atualização e Remoção**

* a) Atualize a idade de um aluno específico na tabela.

In [ ]:
cursor.execute('UPDATE alunos SET idade="24" WHERE nome="João"')

* b) Remova um aluno pelo seu ID.

In [ ]:
cursor.execute('DELETE FROM alunos where id=3')

**5. Criar uma Tabela e Inserir Dados:**

**Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float).
 Insira alguns registros de clientes na tabela.**

In [ ]:
cursor.execute('CREATE TABLE clientes(id INT PRIMARY KEY , nome VARCHAR(100), idade INT, saldo FLOAT)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(1,"Thamires","20","500")')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(2,"Bruno","32","25000")')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(3,"Daniela","41","100000")')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(4,"Ronaldo","25","680")')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(5,"Vanessa","28","2500")')

**6. Consultas e Funções Agregadas: Escreva consultas SQL para realizar as seguintes tarefas:**

* a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [ ]:
clientes = cursor.execute('SELECT nome FROM clientes where idade>30')
for clientes in clientes:
    print(clientes)

* b) Calcule o saldo médio dos clientes.

In [ ]:
clientes = cursor.execute('SELECT AVG(saldo) FROM clientes')
for clientes in clientes:
    print(clientes)

* c) Encontre o cliente com o saldo máximo.

In [ ]:
clientes = cursor.execute('SELECT id, nome, saldo FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)')
for cliente in cliente:
    print(cliente)

* d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
clientes = cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1200')
for clientes in clientes:
    print(clientes)

**7. Atualização e Remoção com Condições**

* a) Atualize o saldo de um cliente específico.

In [ ]:
cursor.execute('UPDATE clientes SET saldo="720" WHERE nome="Thamires"')

* b) Remova um cliente pelo seu ID.

In [ ]:
cursor.execute('DELETE FROM clientes where id=4')

**8. Junção de Tabelas:**

**Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real).
 Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.**

In [ ]:
cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor FLOAT,  FOREIGN KEY (cliente_id) REFERENCES clientes(id))')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES(1,1,"refrigerante","10")')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES(2,2,"sabão em pó","25")')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES(3,3,"pizza","53")')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES(4,4,"óleo","6")')
cursor.execute('INSERT INTO compras(id,cliente_id,produto,valor) VALUES(5,5,"sorvete","12")')

cursor.execute('SELECT c.nome, p.produto, p.valor FROM compras AS p JOIN clientes AS c ON p.cliente_id = c.id')
resultados = cursor.fetchall()
print("Nome do cliente | Produto | Valor")
for resultado in resultados:
    print(resultado[0], "|", resultado[1], "|", resultado[2])

In [ ]:
conexao.commit() # enviar
conexao.close # fechar conexão